{
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "February 18, 2026",
    "intro": [
      "Welcome to Astrologer Studio. We respect your privacy and are committed to protecting your personal data.",
      "This Privacy Policy explains how Astrologer Studio (\"we\", \"us\", \"our\") collects, uses, discloses, and protects information when you access or use our website, applications, and services (collectively, the \"Service\"). Where the EU General Data Protection Regulation (GDPR) applies, we act as the data controller for the processing described in this Policy."
    ],
    "sections": [
      {
        "title": "1. Who This Policy Applies To",
        "content": [
          "This Policy applies to visitors, registered users, and subscribers worldwide. Some rights and disclosures below apply only in certain jurisdictions (for example, the EEA, UK, Switzerland, and certain US states). Where local laws require additional disclosures, we will provide them in this Policy or through in-product notices."
        ]
      },
      {
        "title": "2. Information We Collect",
        "content": [
          "We collect information you provide, information collected automatically when you use the Service, and (where applicable) information from payment and support partners. We do not intentionally collect data from children and the Service is not directed to children."
        ],
        "list": [
          {
            "label": "Account Information",
            "text": "Name (if provided), email address, authentication credentials, subscription status, and account preferences required to create and manage your account."
          },
          {
            "label": "Third-Party Sign-In Data (Google OAuth)",
            "text": "If you sign up or log in using Google, we collect your name, email address, language preference, and profile picture URL as provided by Google. We do not receive or store your Google password."
          },
          {
            "label": "Astrological Chart Data",
            "text": "Birth date, birth time, and birth place (for example, city and country). This information is personal data. It is not a GDPR special category by default, but we treat it as sensitive-in-context because it can be highly personal. If you upload or enter data about other individuals (for example, clients), you confirm you have lawful permission to do so."
          },
          {
            "label": "Content You Submit",
            "text": "Notes, saved charts, interpretations you generate or store, prompts, feedback, and support requests."
          },
          {
            "label": "Transaction and Billing Data (via Dodo Payments)",
            "text": "Purchase history, subscription plan, billing country, tax status, and payment-related records. Payments are processed by Dodo Payments, our Merchant of Record. We do not receive or store your full payment card details. Dodo Payments processes payment data under its own privacy policy and obligations."
          },
          {
            "label": "Usage and Device Data",
            "text": "Log data and analytics such as IP address, device identifiers, browser type, pages viewed, feature usage, timestamps, error logs, and similar diagnostic data."
          },
          {
            "label": "Cookies and Similar Technologies",
            "text": "Identifiers stored in cookies or local storage that are necessary for the Service to function and, if you consent, for analytics or personalization. See our Cookie Policy for details."
          }
        ]
      },
      {
        "title": "3. Purposes and Legal Bases for Processing (GDPR)",
        "content": [
          "Where the GDPR (or similar laws) apply, we process personal data only when we have a valid legal basis. Depending on how you use the Service, the legal bases include contract performance, legitimate interests, consent, and compliance with legal obligations."
        ],
        "list": [
          {
            "label": "To Provide and Operate the Service (Contract)",
            "text": "Create and manage accounts, generate charts and outputs based on the data you input, provide core features, and deliver customer support."
          },
          {
            "label": "To Provide AI Interpretations (Contract)",
            "text": "When you use AI features, we process chart data and your prompts to generate astrological interpretations using third-party AI models."
          },
          {
            "label": "To Manage Subscriptions and Billing (Contract and Legal Obligation)",
            "text": "Enable subscription purchase, renewal, invoicing, tax handling, and payment administration through Dodo Payments as Merchant of Record, including handling chargebacks, fraud prevention, and required accounting records."
          },
          {
            "label": "To Improve and Secure the Service (Legitimate Interests)",
            "text": "Maintain, troubleshoot, monitor performance, prevent abuse, detect fraud, and protect the security and integrity of the Service."
          },
          {
            "label": "To Send Service Communications (Contract and Legitimate Interests)",
            "text": "Send essential messages such as security alerts, billing notices, policy updates, and information about changes to the Service."
          },
          {
            "label": "Marketing (Consent or Legitimate Interests Where Permitted)",
            "text": "If you opt in where required, we may send newsletters or product updates. You can opt out at any time using the unsubscribe link or your account settings."
          },
          {
            "label": "Cookies and Analytics (Consent Where Required)",
            "text": "Set non-essential cookies or similar technologies only when required consent has been obtained under applicable law."
          }
        ]
      },
      {
        "title": "4. How We Share Information",
        "content": [
          "We share personal data only as needed to provide the Service, comply with law, and protect our rights. We do not sell personal data in the traditional sense."
        ],
        "list": [
          {
            "label": "Service Providers (Processors)",
            "text": "Hosting, content delivery, database infrastructure, logging/monitoring, email delivery, customer support tools, and analytics providers. They process data on our behalf under contractual confidentiality and security obligations. See Section 4a below for the current list of specific sub-processors."
          },
          {
            "label": "AI Model Providers (Processors)",
            "text": "We route AI interpretation requests through OpenRouter (openrouter.ai), which may forward them to underlying model providers (such as DeepSeek, OpenAI, Anthropic, or Google, depending on the model selected). We direct these providers not to use your data to train their models."
          },
          {
            "label": "Payments (Dodo Payments as Merchant of Record)",
            "text": "When you purchase a subscription, Dodo Payments (dodopayments.com) processes payment and billing data as Merchant of Record and is responsible for payment compliance, taxes, refunds, and chargebacks under its own terms of service and privacy policy. We receive limited transaction information needed to provision your subscription."
          },
          {
            "label": "Legal and Safety",
            "text": "If required by law, regulation, legal process, or enforceable governmental request, or to protect the rights, safety, and security of Astrologer Studio, our users, or others."
          },
          {
            "label": "Business Transfers",
            "text": "If we undergo a merger, acquisition, restructuring, or sale of assets, personal data may be transferred as part of that transaction, subject to appropriate safeguards."
          }
        ]
      },
      {
        "title": "4a. Third-Party Sub-Processors",
        "content": [
          "The following is the current list of third-party services that process personal data on our behalf or as independent controllers. This list may be updated from time to time as the Service evolves."
        ],
        "list": [
          {
            "label": "Hosting and Infrastructure",
            "text": "Railway Corp. (railway.app) — Application hosting and container orchestration. Servers located in the US and EEA regions depending on deployment configuration."
          },
          {
            "label": "Database",
            "text": "PostgreSQL hosted via managed database services. Connection details and region depend on the deployment configuration."
          },
          {
            "label": "Payments",
            "text": "Dodo Payments (dodopayments.com) — Merchant of Record for subscription billing, tax handling, refunds, and chargebacks."
          },
          {
            "label": "AI Interpretations",
            "text": "OpenRouter (openrouter.ai) — API gateway for AI model access. Underlying model providers may include DeepSeek, OpenAI, Anthropic, or Google depending on configuration."
          },
          {
            "label": "Geocoding and Location Lookup",
            "text": "GeoNames (geonames.org) — Used to resolve city names, coordinates, and timezones from birth place data entered by users."
          },
          {
            "label": "Email (Transactional)",
            "text": "SMTP-based email delivery (currently Zoho Mail) — Used to send password reset emails, account verification, and service notifications. We do not use your email for marketing unless you have opted in."
          },
          {
            "label": "Analytics",
            "text": "Umami (umami.is) — Privacy-focused, cookieless web analytics. Umami does not collect personal data, does not use cookies, and does not track users across sites. Analytics can be disabled entirely by the instance operator."
          },
          {
            "label": "Anti-Abuse",
            "text": "Google reCAPTCHA (google.com/recaptcha) — Used during registration and sensitive actions to prevent automated abuse. Google may set cookies and collect usage data subject to Google’s Privacy Policy."
          },
          {
            "label": "CDN and Static Assets",
            "text": "Statically CDN (statically.io) — Used to deliver static image assets."
          }
        ]
      },
      {
        "title": "5. International Data Transfers",
        "content": [
          "We may process and store information in the EEA and other countries. Where we transfer personal data from the EEA/UK/Switzerland to countries that do not provide an equivalent level of protection, we rely on appropriate safeguards such as European Commission adequacy decisions or Standard Contractual Clauses, and where relevant additional measures."
        ]
      },
      {
        "title": "6. Data Retention",
        "content": [
          "We retain personal data only for as long as necessary for the purposes described in this Policy. The specific retention periods are as follows:"
        ],
        "list": [
          {
            "label": "Account Data (name, email, preferences)",
            "text": "Retained for as long as your account is active. Upon account deletion or closure request, account data is permanently deleted from our production databases within 30 days."
          },
          {
            "label": "Astrological Chart Data (birth date, birth time, birth place, saved charts)",
            "text": "Retained for as long as your account is active. You may delete individual subjects and charts at any time. Upon account deletion, all chart data is permanently deleted within 30 days."
          },
          {
            "label": "AI Interpretation Cache",
            "text": "Cached AI-generated interpretations are automatically purged after 24 hours or when the cache is invalidated, whichever comes first."
          },
          {
            "label": "Billing and Transaction Records",
            "text": "Retained for as long as required by applicable tax and accounting laws (typically up to 10 years in the EU) even after account deletion, as mandated by law. These records are managed by Dodo Payments as Merchant of Record."
          },
          {
            "label": "Server Logs and Security Data",
            "text": "IP addresses, error logs, and security event logs are retained for up to 90 days for security monitoring and abuse prevention, then automatically deleted."
          },
          {
            "label": "Backups",
            "text": "Encrypted backups that may contain personal data are rotated and permanently deleted within 30 days of creation. After account deletion, your data will be purged from all backup cycles within this 30-day window."
          }
        ]
      },
      {
        "title": "7. Security",
        "content": [
          "We use administrative, technical, and organizational measures designed to protect personal data against unauthorized access, alteration, disclosure, or destruction. Measures may include encryption in transit, access controls, logging, and least-privilege practices. No method of transmission or storage is 100 percent secure, and we cannot guarantee absolute security."
        ]
      },
      {
        "title": "8. Your Rights (EEA/UK and Similar Laws)",
        "content": [
          "Depending on your location, you may have rights over your personal data. These rights are not absolute and may be subject to legal limitations."
        ],
        "list": [
          {
            "label": "Right of Access",
            "text": "You can request confirmation of whether we process your personal data and obtain a copy of it."
          },
          {
            "label": "Right to Rectification",
            "text": "You can request correction of inaccurate or incomplete personal data."
          },
          {
            "label": "Right to Erasure",
            "text": "You can request deletion of personal data in certain circumstances."
          },
          {
            "label": "Right to Restrict Processing",
            "text": "You can request that we limit processing in certain circumstances."
          },
          {
            "label": "Right to Data Portability",
            "text": "You can request a copy of certain data in a structured, commonly used, machine-readable format, and to transmit it to another controller where technically feasible."
          },
          {
            "label": "Right to Object",
            "text": "You can object to processing based on legitimate interests, and you can object at any time to direct marketing."
          },
          {
            "label": "Withdraw Consent",
            "text": "Where processing is based on consent, you can withdraw consent at any time. Withdrawal does not affect the lawfulness of processing before withdrawal."
          },
          {
            "label": "Lodge a Complaint",
            "text": "If you are in the EEA/UK, you have the right to lodge a complaint with your local data protection supervisory authority."
          }
        ]
      },
      {
        "title": "9. Additional Disclosures for Certain Regions (Global)",
        "content": [
          "If you reside outside the EEA/UK, you may have similar rights under local laws (for example, rights to access, delete, or correct personal information). Where applicable, you may also have rights to opt out of certain targeted advertising or \"sale\"/\"sharing\" concepts as defined by local law. We do not provide astrology outputs for the purpose of making decisions about employment, housing, credit, insurance, or similar high-stakes outcomes."
        ]
      },
      {
        "title": "10. Automated Processing",
        "content": [
          "Astrologer Studio generates charts and interpretations using software logic based on the birth and preference data you provide. We do not engage in automated decision-making that produces legal effects or similarly significant effects about you within the meaning of GDPR Article 22."
        ]
      },
      {
        "title": "11. Changes to This Policy",
        "content": [
          "We may update this Privacy Policy from time to time. We will post the updated version and revise the \"Last Updated\" date. If changes are material, we will provide an additional notice, such as an in-app notification or email, where required."
        ]
      }
    ],
    "contact": {
      "text": "If you have questions about this Privacy Policy or want to exercise your rights, contact us at:",
      "email": "admin@astrologerstudio.com"
    }
  },
  "terms": {
    "title": "Terms of Service",
    "lastUpdated": "February 18, 2026",
    "intro": [
      "Please read these Terms of Service (\"Terms\") carefully before using Astrologer Studio (the \"Service\"). By accessing or using the Service, you agree to be bound by these Terms.",
      "If you do not agree to these Terms, do not use the Service. If you use the Service on behalf of a company or other entity, you represent that you have authority to bind that entity to these Terms."
    ],
    "sections": [
      {
        "title": "1. Eligibility and Account Registration",
        "content": [
          "You must be at least 16 years old to use the Service in the European Economic Area and the United Kingdom, and at least the minimum age required by applicable law elsewhere. If you are under the applicable age of majority, you may use the Service only with permission of a parent or legal guardian.",
          "You must provide accurate and complete information when creating an account and keep your account information up to date. You are responsible for maintaining the confidentiality of your login credentials and for all activities that occur under your account.",
          "By creating an account, you agree that we may send you newsletters, marketing or promotional materials, and other information offering products or services. You may opt out of receiving any, or all, of these communications from us by following the unsubscribe link or instructions provided in any email we send."
        ]
      },
      {
        "title": "2. Subscriptions, Billing, and Payments (Dodo Payments)",
        "content": [
          "Astrologer Studio is offered as a subscription SaaS. Payments, invoicing, taxes, refunds, and chargebacks are handled by our reseller, Dodo Payments, who acts as the Merchant of Record. Your purchase is made directly from Dodo Payments, and Dodo Payments’s terms of sale and privacy policy apply to the payment processing.",
          "By purchasing a subscription, you authorize Dodo Payments to charge your selected payment method at the then-current subscription price, including any applicable taxes, on a recurring basis until you cancel. Subscriptions renew automatically at the end of each billing cycle unless you cancel renewal before the next billing date."
        ],
        "list": [
          {
            "label": "Free Trials and Promotions (if offered)",
            "text": "If we offer a free trial or promotion, eligibility and duration will be disclosed at signup. Unless you cancel before the trial ends, your subscription will convert to a paid plan and Dodo Payments will charge the applicable fee."
          },
          {
            "label": "Price Changes",
            "text": "We may change subscription prices or plan features. If a change affects your subscription, we will provide advance notice where required. Any changes will apply from the next renewal or as otherwise permitted by law."
          },
          {
            "label": "Cancellations",
            "text": "You can cancel subscription renewal at any time through your account settings or through the Dodo Payments customer portal (accessible via your invoice email). Cancellation stops future renewals. You will retain access through the end of the current paid period, unless otherwise stated at purchase."
          },
          {
            "label": "Refunds and Right of Withdrawal (Consumers)",
            "text": "Refunds are handled in line with Dodo Payments’s policies and applicable consumer protection laws. If you are a consumer in the EEA/UK, you have a 14-day right of withdrawal for distance contracts. However, because Astrologer Studio is a digital service that begins performing immediately upon account activation or subscription purchase, you expressly request that the Service begins before the withdrawal period has expired and you acknowledge that you will therefore lose your right of withdrawal once the Service has started (for example, when you generate your first chart, access chart data, or use any core feature). This consent and acknowledgement are requested at checkout as required by EU Directive 2011/83/EU. Notwithstanding the above, we offer a voluntary 30-day money-back guarantee as described in our Refund Policy."
          }
        ]
      },
      {
        "title": "3. Digital Service Quality and Updates (EU Consumer Rules)",
        "content": [
          "We aim to provide the Service with reasonable care and skill and to keep it available and secure. The Service may evolve over time, including changes to features, interfaces, and supported devices.",
          "If you are a consumer in the EU, mandatory consumer protection rules may apply to digital services, including rules on conformity, remedies, and updates. Nothing in these Terms limits mandatory rights you may have under applicable law."
        ]
      },
      {
        "title": "4. Your Content and Client Data",
        "content": [
          "You may enter, upload, or store content such as birth details, notes, and saved charts (\"User Content\"). You retain your rights to your User Content.",
          "If you input personal data relating to other individuals (for example, clients), you represent and warrant that you have provided all required notices and obtained any necessary consents or other lawful basis to share that data with us for processing in the Service."
        ]
      },
      {
        "title": "5. Acceptable Use",
        "content": [
          "You agree to use the Service lawfully and responsibly. You will not misuse the Service or attempt to disrupt, compromise, or reverse engineer it."
        ],
        "list": [
          {
            "text": "Access or use the Service in a way that violates any applicable law or regulation."
          },
          {
            "text": "Probe, scan, or test the vulnerability of any system or network, or breach any security or authentication measures."
          },
          {
            "text": "Interfere with or disrupt the integrity or performance of the Service, including through automated scraping, denial-of-service attacks, or malicious code."
          },
          {
            "text": "Use the Service to process highly sensitive personal data beyond what is necessary for chart creation (for example, health or biometric data) unless explicitly supported and permitted by law."
          },
          {
            "text": "Use outputs to make or justify unlawful discrimination or to make high-stakes decisions about employment, housing, credit, insurance, or similar outcomes."
          },
          {
            "text": "Misuse AI features to generate harmful, illegal, or abusive content, or in a way that bypasses the safety filters of our AI providers."
          }
        ]
      },
      {
        "title": "6. Intellectual Property and License",
        "content": [
          "The Service, including its software, designs, text, logos, trademarks, and all related intellectual property, is owned by Astrologer Studio and its licensors. These Terms do not grant you any ownership rights in the Service.",
          "Subject to your compliance with these Terms and payment of applicable fees, we grant you a limited, non-exclusive, non-transferable, revocable license to access and use the Service for your personal use, and for professional astrological practice only to the extent permitted by your subscription tier."
        ]
      },
      {
        "title": "7. Astrology Disclaimer",
        "content": [
          "Astrology is not an exact science. The charts, calculations, transit forecasts, and AI-generated interpretations provided by Astrologer Studio are intended exclusively for entertainment, personal research, and educational purposes. Outputs are generated based on the data you provide and the astrological methodologies implemented in the software, and they do not constitute verified, scientifically proven, or objectively reliable information.",
          "The Service does not provide medical, psychological, legal, or financial advice. By using the Service, you expressly acknowledge and agree that you will not base any medical, financial, legal, or psychological decision on the outputs of the Service. You assume full responsibility for how you interpret and use the outputs."
        ]
      },
      {
        "title": "8. Disclaimer of Warranties",
        "content": [
          "TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICE IS PROVIDED \"AS IS\" AND \"AS AVAILABLE\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY, OR NON-INFRINGEMENT.",
          "Without limiting the foregoing, we do not warrant that: (a) the Service will be uninterrupted, timely, secure, or error-free; (b) the astrological calculations, charts, ephemeris data, or AI-generated interpretations will be accurate, complete, or free from computational errors or bugs; (c) any defects or errors in the Service will be corrected; or (d) the results obtained from the Service will meet your expectations. You acknowledge that software may contain bugs and that astrological calculations may vary depending on the algorithms, data sources, and methodologies used.",
          "Nothing in this section excludes or limits mandatory warranties that cannot be excluded or limited under applicable consumer protection law."
        ]
      },
      {
        "title": "9. Service Availability and Changes",
        "content": [
          "We strive to keep the Service available, but we do not guarantee uninterrupted access. The Service may be temporarily unavailable due to maintenance, updates, or circumstances beyond our reasonable control. We are not liable for any damages arising from service interruptions, temporary data unavailability, or downtime.",
          "We may modify, suspend, or discontinue parts of the Service. If you have a paid subscription and a change materially reduces core functionality, you may have additional rights under applicable law."
        ]
      },
      {
        "title": "10. Termination and Account Suspension",
        "content": [
          "You may stop using the Service at any time and may delete your account where the feature is available. If you delete your account, subscription billing must also be canceled to stop future charges.",
          "We may suspend or terminate your access to the Service if you materially breach these Terms, if required by law, or to protect the security of the Service. Where reasonable, we will provide notice and an opportunity to remedy.",
          "Notwithstanding the above, we reserve the right to immediately suspend or permanently terminate your account without prior notice in the event of: (a) attempted or actual unauthorized access to our systems, networks, or other users' data; (b) denial-of-service attacks, port scanning, or any other form of cyber attack directed at the Service; (c) fraudulent use of the Service, including but not limited to payment fraud or identity misrepresentation; (d) sharing, reselling, or unauthorized distribution of account credentials; or (e) any activity that, in our sole reasonable judgment, poses an immediate threat to the security, integrity, or availability of the Service or the data of other users."
        ]
      },
      {
        "title": "11. Limitation of Liability",
        "content": [
          "To the maximum extent permitted by law, Astrologer Studio will not be liable for any indirect, incidental, special, consequential, or punitive damages, or for any loss of profits, revenue, data, goodwill, or other intangible losses, arising out of or related to your use of or inability to use the Service.",
          "Nothing in these Terms excludes or limits liability that cannot be excluded or limited under applicable law, including for death or personal injury caused by negligence, fraud, or certain statutory consumer rights."
        ]
      },
      {
        "title": "12. Indemnification",
        "content": [
          "You agree to indemnify and hold Astrologer Studio harmless from and against claims, liabilities, damages, losses, and expenses (including reasonable legal fees) arising out of or related to your misuse of the Service, your violation of these Terms, or your User Content, including your use of third-party personal data without a lawful basis."
        ]
      },
      {
        "title": "13. Governing Law and Dispute Resolution",
        "content": [
          "These Terms are governed by the laws of the jurisdiction where we are established, as stated in the Service’s legal notice, without regard to conflict of laws rules.",
          "If you are a consumer in the EEA/UK, you may benefit from mandatory consumer protection laws in your country of residence and you may generally bring claims in your local courts. If you are not a consumer, disputes will be resolved in the competent courts where we are established, unless applicable law provides otherwise."
        ]
      },
      {
        "title": "14. Changes to These Terms",
        "content": [
          "We may update these Terms from time to time. We will post the updated Terms and update the \"Last Updated\" date. If changes are material, we will provide additional notice where required. By continuing to use the Service after the effective date of the updated Terms, you agree to the updated Terms."
        ]
      }
    ],
    "contact": {
      "text": "If you have any questions about these Terms, contact us at:",
      "email": "admin@astrologerstudio.com"
    }
  },
  "cookies": {
    "title": "Cookie Policy",
    "lastUpdated": "January 14, 2026",
    "intro": [
      "This Cookie Policy explains what cookies and similar technologies are, how Astrologer Studio uses them, and the choices you have. This Policy should be read together with our Privacy Policy.",
      "In the EEA/UK and many other regions, we set non-essential cookies only after you provide consent, and you can change your preferences at any time."
    ],
    "sections": [
      {
        "title": "1. What Are Cookies and Similar Technologies?",
        "content": [
          "Cookies are small text files stored on your device when you visit a website. Similar technologies include local storage, SDK identifiers, pixels, and device identifiers. These technologies can help a site function, remember preferences, and understand how the site is used."
        ]
      },
      {
        "title": "2. How We Use Cookies",
        "content": [
          "We use cookies and similar technologies for the operation of the Service, to keep you signed in, to remember your preferences, to protect against fraud and abuse, and, if you consent where required, to measure usage and improve the Service."
        ]
      },
      {
        "title": "3. Categories of Cookies We Use",
        "content": [
          "The cookies used by the Service fall into the categories below. Specific cookie names and durations may vary over time as the Service evolves."
        ],
        "list": [
          {
            "label": "Strictly Necessary Cookies",
            "text": "Required for core functionality such as authentication, session management, security, load balancing, and fraud prevention. These are generally enabled by default because the Service cannot operate properly without them."
          },
          {
            "label": "Preferences and Functionality Cookies",
            "text": "Remember choices you make, such as language, region, or UI preferences, to provide a more consistent experience."
          },
          {
            "label": "Analytics and Performance Cookies (Optional)",
            "text": "Help us understand how the Service is used, which features are most useful, and how to improve performance. Where required, we enable these only with your consent and configure them to reduce identification where feasible."
          },
          {
            "label": "Third-Party Cookies and Checkout Technologies (Dodo Payments)",
            "text": "When you purchase a subscription, Dodo Payments may set cookies or similar technologies during checkout to process payments, prevent fraud, and manage compliance. These technologies are controlled by Dodo Payments and are subject to Dodo Payments’s policies."
          }
        ]
      },
      {
        "title": "4. Your Choices and Managing Cookies",
        "content": [
          "You can manage cookie preferences through the cookie banner or settings available in the Service (where provided). You can also control cookies through your browser settings, including deleting existing cookies and blocking future cookies.",
          "If you block strictly necessary cookies, parts of the Service may not function correctly, including login and subscription management."
        ]
      },
      {
        "title": "5. Updates to This Cookie Policy",
        "content": [
          "We may update this Cookie Policy from time to time to reflect changes in technologies, legal requirements, or our practices. We will post the updated version and update the \"Last Updated\" date."
        ]
      }
    ],
    "contact": {
      "text": "If you have any questions about our Cookie Policy, contact us at:",
      "email": "admin@astrologerstudio.com"
    }
  },
  "accessibility": {
    "title": "Accessibility Statement",
    "lastUpdated": "January 14, 2026",
    "intro": [
      "Astrologer Studio is committed to digital accessibility for people with disabilities. We work to provide an inclusive experience and to continuously improve the accessibility of the Service.",
      "We design and develop with reference to the Web Content Accessibility Guidelines (WCAG) and relevant European accessibility requirements for digital services, including the European Accessibility Act where applicable."
    ],
    "sections": [
      {
        "title": "Conformance Status",
        "content": [
          "WCAG defines requirements to improve accessibility for people with disabilities and describes three levels of conformance: A, AA, and AAA.",
          "Astrologer Studio aims to conform to WCAG 2.1 Level AA and, where feasible, aligns improvements with newer guidance. Some parts of the Service may not yet fully conform, meaning we are partially conformant at this time."
        ]
      },
      {
        "title": "Measures to Support Accessibility",
        "content": [
          "We take practical steps to improve accessibility, including accessibility-aware design reviews, keyboard navigation checks, color contrast checks, and remediation of issues discovered through user feedback."
        ]
      },
      {
        "title": "Known Limitations",
        "content": [
          "Some experiences may present accessibility limitations, for example certain complex chart visualizations, third-party embedded components (such as payment checkout), or older pages that have not yet been fully updated. We prioritize fixes based on impact and frequency."
        ]
      },
      {
        "title": "Feedback and Contact",
        "content": [
          "We welcome your feedback on the accessibility of Astrologer Studio. If you encounter an accessibility barrier, tell us what page or feature you were using, the issue you encountered, and, if possible, your device and browser. We will do our best to respond within a reasonable time."
        ],
        "list": [
          {
            "label": "Email",
            "text": "admin@astrologerstudio.com"
          }
        ]
      },
      {
        "title": "Compatibility and Technical Specifications",
        "content": [
          "Astrologer Studio is designed to work with modern browsers and common assistive technologies. Accessibility relies on the following technologies:"
        ],
        "list": [
          {
            "text": "HTML"
          },
          {
            "text": "WAI-ARIA"
          },
          {
            "text": "CSS"
          },
          {
            "text": "JavaScript"
          }
        ]
      }
    ]
  },
  "license": {
    "title": "License & Open Source",
    "lastUpdated": "January 14, 2026",
    "intro": [
      "Astrologer Studio is proud to be Free (Libre) Open Source Software. Our source code is available to the public to ensure transparency, security, and contribution to the astrological community.",
      "We believe that professional astrology tools should be accessible and transparent."
    ],
    "sections": [
      {
        "title": "1. GNU AGPLv3 License",
        "content": [
          "The source code of Astrologer Studio is licensed under the GNU Affero General Public License version 3 (AGPLv3).",
          "This means you are free to run, study, share, and modify the software. If you run a modified version of this software as a network service (like a website), you must also share your modifications under the same AGPLv3 license."
        ]
      },
      {
        "title": "2. Free Software vs. Freeware",
        "content": [
          "\"Free Software\" refers to freedom, not price. Think of it as \"free speech,\" not \"free beer\".",
          "While the code is freely available for you to host yourself, running a reliable, secure, and always-available SaaS (Software as a Service) requires significant resources.",
          "We charge for the hosted version (Astrologer Studio SaaS) to cover server costs, development time, and to provide you with a convenient, ready-to-use professional tool."
        ]
      },
      {
        "title": "3. Commercial SaaS with an Open Source Heart",
        "content": [
          "By subscribing to Astrologer Studio, you are not just buying a tool; you are supporting the development of free software for the astrology community.",
          "Your subscription ensures that:",
          "- The project remains sustainable and actively developed.",
          "- You receive professional support and assistance.",
          "- You get a hassle-free experience with cloud backups and regular updates."
        ]
      },
      {
        "title": "4. Heir to OpenAstro",
        "content": [
          "Astrologer Studio considers itself the spiritual successor to OpenAstro. We aim to carry the torch of high-quality, open-source astrology software into the modern web era.",
          "We are committed to keeping the core calculation engine open and verifiable by the community."
        ]
      },
      {
        "title": "Source Code",
        "content": [
          "You can find our source code on GitHub. We encourage developers to contribute, audit, and help us improve.",
          "GitHub Repository: https://github.com/g-battaglia/astrologerstudio"
        ]
      }
    ],
    "contact": {
      "text": "For licensing inquiries or support:",
      "email": "admin@astrologerstudio.com"
    }
  },
  "refund": {
    "title": "Refund Policy",
    "lastUpdated": "January 14, 2026",
    "intro": ["At Astrologer Studio, we want you to be completely satisfied with our professional astrology tools."],
    "sections": [
      {
        "title": "Payment Processing",
        "content": [
          "Our order process is conducted by our online reseller Dodo Payments. Dodo Payments is the Merchant of Record for all our orders. Dodo Payments provides all customer service inquiries regarding billing and handles returns."
        ]
      },
      {
        "title": "30-Day Money-Back Guarantee",
        "content": [
          "We offer a 30-day money-back guarantee on all our subscription plans. If you are not satisfied with Astrologer Studio for any reason, you can request a full refund within 30 days of your initial purchase."
        ]
      },
      {
        "title": "How to Request a Refund",
        "content": ["To request a refund, please contact our support team or Dodo Payments directly."],
        "list": [
          {
            "label": "Email",
            "text": "admin@astrologerstudio.com"
          },
          {
            "label": "Dodo Payments Support",
            "text": "https://dodopayments.com/help"
          }
        ]
      },
      {
        "title": "Cancellation",
        "content": [
          "You can cancel your subscription at any time from your account settings. Your access will continue until the end of your current billing period."
        ]
      }
    ]
  }
}
